#!/usr/bin/python

# 题目：企业发放的奖金根据利润提成。
# 利润(I)低于或等于10万元时，奖金可提10%；
# 利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；
# 20万到40万之间时，高于20万元的部分，可提成5%；
# 40万到60万之间时高于40万元的部分，可提成3%；
# 60万到100万之间时，高于60万元的部分，可提成1.5%，
# 高于100万元时，超过100万元的部分按1%提成，
# 从键盘输入当月利润I，求应发放奖金总数？
# 程序分析：请利用数轴来分界，定位。注意定义时需把奖金定义成长整型。

def obtain_profit(value_00):
    if value_00 <= 100000:
        return value_00 * 0.1
    if (value_00 > 100000) and (value_00 < 200000):
        return 100000 * 0.1 + (value_00 - 100000) * 0.075
    if (value_00 >= 200000) and (value_00 < 400000):
        return 100000 * 0.1 + 100000 * 0.075 + (value_00 - 200000) * 0.05
    if (value_00 >= 400000) and (value_00 < 600000):
        return 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + (value_00 - 400000) * 0.03
    if (value_00 >= 600000) and (value_00 < 1000000):
        return 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + (value_00 - 600000) * 0.015
    if (value_00 >= 1000000):
        return 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + 400000 * 0.015 + (
                                                                                                    value_00 - 1000000) * 0.01


if __name__ == "__main__":
    while True:
        value_00 = input("请输入当月利润数: ")
        if (value_00 is None) or len(value_00) <= 0:
            print("输出有无,程序退出")
            break;
        print(obtain_profit(int(value_00)))
